# SetOffsetForIntersectingReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..SetOffsetForIntersectingReference Method
PartMakerMethodToDivideVolumes Class See Also
---
Sets offset for the intersecting reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetOffsetForIntersectingReference(
	ElementId intersectingReference,
	double offset
)
```

Visual Basic
---
```text
Public Sub SetOffsetForIntersectingReference ( _
	intersectingReference As ElementId, _
	offset As Double _
)
```

Visual C++
---
```text
public:
void SetOffsetForIntersectingReference(
	ElementId^ intersectingReference,
	double offset
)
```

# ### Parameters
intersectingReference
    Type: Autodesk.Revit.DB..::..ElementId The intersecting reference that will be offset.
offset
    Type: System..::..Double The new offset.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | PartMaker does not use the specified intersecting reference. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace